resource/request_file/CV/BajajAllianz_CV_Premium.xml

<x:Envelope xmlns:x="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl" xmlns:typ="http://com/bajajallianz/motWebPolicy/WebServicePolicy.wsdl/types/">
    <x:Header/>
    <x:Body>
        <web:calculateMotorPremiumSig>
            <web:pUserId>___insurer_integration_service_user___</web:pUserId>
            <web:pPassword>___insurer_integration_service_password___</web:pPassword>
            <web:pVehicleCode>___dbmaster_insurer_vehicle_code___</web:pVehicleCode>
            <web:pCity>___dbmaster_insurer_rto_city_name___</web:pCity>
            <web:pWeoMotPolicyIn_inout>
                <typ:vehicleTypeCode>___product_id___</typ:vehicleTypeCode>
                <typ:vehicleSubtype>___dbmaster_insurer_vehicle_variant_name___</typ:vehicleSubtype>
                <typ:elecAccTotal>___electrical_accessory___</typ:elecAccTotal>
                <typ:addLoadingOn></typ:addLoadingOn>
                <typ:nonElecAccTotal>___non_electrical_accessory___</typ:nonElecAccTotal>
                <typ:polType>___vehicle_insurance_type___</typ:polType>
                <typ:registrationNo>___registration_no___</typ:registrationNo>
                <typ:partnerType>___vehicle_registration_type___</typ:partnerType>
                <typ:ncb>___vehicle_ncb_next___</typ:ncb>
                <typ:prvClaimStatus>___is_claim_exists___</typ:prvClaimStatus>
                <typ:registrationDate>___vehicle_registration_date___</typ:registrationDate>
                <typ:miscVehType>0</typ:miscVehType>
                <typ:fuel>___dbmaster_insurer_vehicle_fueltype___</typ:fuel>
                <typ:chassisNo></typ:chassisNo>
                <typ:contractId></typ:contractId>
                <typ:yearManf>___vehicle_manf_year___</typ:yearManf>
                <typ:spDiscRate></typ:spDiscRate>
                <typ:cubicCapacity>___dbmaster_insurer_vehicle_cubiccapacity___</typ:cubicCapacity>
                <typ:regiLocOther>___dbmaster_insurer_rto_city_name___</typ:regiLocOther>
                <typ:addLoading>0</typ:addLoading>
                <typ:vehicleSubtypeCode>___dbmaster_insurer_vehicle_variant_code___</typ:vehicleSubtypeCode>
                <typ:prvPolicyRef></typ:prvPolicyRef><!--2523532523-->
                <typ:vehicleMake>___dbmaster_insurer_vehicle_make_name___</typ:vehicleMake>
                <typ:autoMembership></typ:autoMembership>
                <typ:termStartDate>___policy_start_date___</typ:termStartDate>
                <typ:carryingCapacity>___dbmaster_insurer_vehicle_seatingcapacity___</typ:carryingCapacity>
                <typ:termEndDate>___policy_end_date___</typ:termEndDate>
                <typ:hypo></typ:hypo>
                <typ:branchCode>___insurer_integration_location_code___</typ:branchCode>
                <typ:prvNcb>___vehicle_ncb_current___</typ:prvNcb>
                <typ:vehicleMakeCode>___dbmaster_insurer_vehicle_make_code___</typ:vehicleMakeCode>
                <typ:vehicleIdv>___vehicle_expected_idv___</typ:vehicleIdv>
                <typ:prvInsCompany>___dbmaster_previousinsurer_code___</typ:prvInsCompany>
                <typ:engineNo></typ:engineNo>
                <typ:product4digitCode>___vehicle_insurance_subtype_4___</typ:product4digitCode>
                <typ:color></typ:color>
                <typ:vehicleModel>___dbmaster_insurer_vehicle_model_name___</typ:vehicleModel>
                <typ:vehicleType>___product_id_3___</typ:vehicleType>
                <typ:prvExpiryDate>___policy_expiry_date___</typ:prvExpiryDate>
                <typ:tpFinType></typ:tpFinType>
                <typ:deptCode>18</typ:deptCode>
                <typ:vehicleModelCode>___dbmaster_insurer_vehicle_model_code___</typ:vehicleModelCode>
                <typ:registrationLocation>___dbmaster_insurer_rto_city_name___</typ:registrationLocation>
                <typ:zone>___dbmaster_insurer_rto_zone_code___</typ:zone>
            </web:pWeoMotPolicyIn_inout>
            <web:accessoriesList_inout>
                <typ:WeoMotAccessoriesUser>
                    <typ:accModel></typ:accModel>
                    <typ:accTypeCode></typ:accTypeCode>
                    <typ:accCategoryCode></typ:accCategoryCode>
                    <typ:accCount></typ:accCount>
                    <typ:contractId></typ:contractId>
                    <typ:accIev></typ:accIev>
                    <typ:accMake></typ:accMake>
                </typ:WeoMotAccessoriesUser>
            </web:accessoriesList_inout>
            <web:paddoncoverList_inout>
                <typ:WeoMotGenParamUser>
                    <typ:paramDesc></typ:paramDesc>
                    <typ:paramRef></typ:paramRef>
                </typ:WeoMotGenParamUser>
            </web:paddoncoverList_inout>
            <web:motExtraCover>
                <typ:sideCarValue></typ:sideCarValue>
                <typ:covernoteNo></typ:covernoteNo>
                <typ:noOfTrailers></typ:noOfTrailers>
                <typ:subImdcode></typ:subImdcode>
                <typ:covernoteDate></typ:covernoteDate>
                <typ:cngValue></typ:cngValue>
                <typ:fibreGlassValue></typ:fibreGlassValue>
                <typ:voluntaryExcess></typ:voluntaryExcess>
                <typ:totalTrailerValue></typ:totalTrailerValue>
                <typ:extraField1></typ:extraField1>
                <typ:sumInsuredTotalNamedPa></typ:sumInsuredTotalNamedPa>
                <typ:geogExtn></typ:geogExtn>
                <typ:noOfPersonsLlo></typ:noOfPersonsLlo>
                <typ:noOfEmployeesLle></typ:noOfEmployeesLle>
                <typ:extraField2></typ:extraField2>
                <typ:extraField3></typ:extraField3>
                <typ:sumInsuredPa></typ:sumInsuredPa>
                <typ:noOfPersonsPa></typ:noOfPersonsPa>
            </web:motExtraCover>
            <web:pQuestList_inout>
                <typ:WeoBjazMotQuestionaryUser>
                    <typ:questionRef></typ:questionRef>
                    <typ:contractId></typ:contractId>
                    <typ:questionVal></typ:questionVal>
                </typ:WeoBjazMotQuestionaryUser>
            </web:pQuestList_inout>
            <web:pDetariffObj_inout>
                <typ:driverQualificationCode></typ:driverQualificationCode>
                <typ:vehPurchaseType></typ:vehPurchaseType>
                <typ:extCol25></typ:extCol25>
                <typ:extCol26></typ:extCol26>
                <typ:tacMakeCode></typ:tacMakeCode>
                <typ:extCol23></typ:extCol23>
                <typ:extCol24></typ:extCol24>
                <typ:extCol29></typ:extCol29>
                <typ:extCol27></typ:extCol27>
                <typ:extCol28></typ:extCol28>
                <typ:extCol33></typ:extCol33>
                <typ:extCol32></typ:extCol32>
                <typ:extCol31></typ:extCol31>
                <typ:extCol30></typ:extCol30>
                <typ:registrationAuth></typ:registrationAuth>
                <typ:extCol12></typ:extCol12>
                <typ:extCol13></typ:extCol13>
                <typ:extCol14></typ:extCol14>
                <typ:extCol15></typ:extCol15>
                <typ:extCol16></typ:extCol16>
                <typ:extCol17></typ:extCol17>
                <typ:extCol18></typ:extCol18>
                <typ:extCol19></typ:extCol19>
                <typ:otherGoodsFrequency></typ:otherGoodsFrequency>
                <typ:extCol20></typ:extCol20>
                <typ:extCol22></typ:extCol22>
                <typ:incurredClmExpCode></typ:incurredClmExpCode>
                <typ:extCol21></typ:extCol21>
                <typ:clmHistCode></typ:clmHistCode>
                <typ:roadType></typ:roadType>
                <typ:bodyType></typ:bodyType>
                <typ:monthOfMfg></typ:monthOfMfg>
                <typ:natureOfGoods></typ:natureOfGoods>
                <typ:extCol9></typ:extCol9>
                <typ:extCol8></typ:extCol8>
                <typ:extCol7></typ:extCol7>
                <typ:extCol6></typ:extCol6>
                <typ:vehPurchaseDate></typ:vehPurchaseDate>
                <typ:extCol5></typ:extCol5>
                <typ:extCol4></typ:extCol4>
                <typ:vehDrivenBy></typ:vehDrivenBy>
                <typ:extCol3></typ:extCol3>
                <typ:extCol2></typ:extCol2>
                <typ:extCol1></typ:extCol1>
                <typ:goodsTransType></typ:goodsTransType>
                <typ:permitType></typ:permitType>
                <typ:extCol38></typ:extCol38>
                <typ:extCol39></typ:extCol39>
                <typ:extCol34></typ:extCol34>
                <typ:extCol35></typ:extCol35>
                <typ:extCol36></typ:extCol36>
                <typ:extCol10></typ:extCol10>
                <typ:extCol37></typ:extCol37>
                <typ:extCol11></typ:extCol11>
                <typ:extCol40></typ:extCol40>
                <typ:driverExperience></typ:driverExperience>
            </web:pDetariffObj_inout>
            <web:premiumDetailsOut_out>
                <typ:serviceTax></typ:serviceTax>
                <typ:collPremium></typ:collPremium>
                <typ:totalActPremium></typ:totalActPremium>
                <typ:netPremium></typ:netPremium>
                <typ:totalIev></typ:totalIev>
                <typ:addLoadPrem></typ:addLoadPrem>
                <typ:totalNetPremium></typ:totalNetPremium>
                <typ:imtOut></typ:imtOut>
                <typ:totalPremium></typ:totalPremium>
                <typ:ncbAmt></typ:ncbAmt>
                <typ:stampDuty></typ:stampDuty>
                <typ:totalOdPremium></typ:totalOdPremium>
                <typ:spDisc></typ:spDisc>
                <typ:finalPremium></typ:finalPremium>
            </web:premiumDetailsOut_out>
            <web:premiumSummeryList_out>
                <typ:WeoMotPremiumSummaryUser>
                    <typ:od></typ:od>
                    <typ:paramDesc></typ:paramDesc>
                    <typ:paramRef></typ:paramRef>
                    <typ:net></typ:net>
                    <typ:act></typ:act>
                    <typ:paramType></typ:paramType>
                </typ:WeoMotPremiumSummaryUser>
            </web:premiumSummeryList_out>
            <web:pError_out>
                <typ:WeoTygeErrorMessageUser>
                    <typ:errNumber></typ:errNumber>
                    <typ:parName></typ:parName>
                    <typ:property></typ:property>
                    <typ:errText></typ:errText>
                    <typ:parIndex></typ:parIndex>
                    <typ:errLevel></typ:errLevel>
                </typ:WeoTygeErrorMessageUser>
            </web:pError_out>
            <web:pErrorCode_out></web:pErrorCode_out>
            <web:pTransactionId_inout></web:pTransactionId_inout>
            <web:pTransactionType></web:pTransactionType>
            <web:pContactNo></web:pContactNo>
        </web:calculateMotorPremiumSig>
    </x:Body>
</x:Envelope>
